Enums/СтатусыТаможенныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыТаможенныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТаможенноеОформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпущеноСТаможни</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НоменклатураГТД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>НоменклатураГТД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодУКТВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУКТВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТаможеннаяДекларацияИмпортЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
//@skip-warning
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	//++ Локализация
	//-- Локализация
		
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
//@skip-warning
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	//++ Локализация	
	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
//@skip-warning
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//++ Локализация	
	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
//@skip-warning
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	//++ Локализация	
	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//++ Локализация
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение И Объект.Статус = Перечисления.СтатусыТаможенныхДеклараций.ВыпущеноСТаможни Тогда
		ЗаполнитьНомераГТД(Объект);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
//@skip-warning
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.ТаможеннаяДекларацияИмпорт - Исходный документ, который является источником копирования.
//
//@skip-warning
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти


#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
//@skip-warning
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
//@skip-warning
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
//@skip-warning
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	//++ Локализация
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

	ВзаиморасчетыСервер.КарточкаРасчетовСПоставщиком_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов);

	ВзаиморасчетыСервер.ЗадолженностьПоставщикам_ДобавитьКомандуОтчетаПоДокументам(КомандыОтчетов);
	//-- Локализация
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
//@skip-warning
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти



// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

//++ Локализация

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНомераГТД(Объект)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.КодУКТВЭД КАК КодУКТВЭД,
	|	ТаблицаТовары.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.КодУКТВЭД КАК КодУКТВЭД,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.НомерГТД = ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПустаяНоменклатураГТД,
	|	ЕСТЬNULL(СправочникНоменклатура.ВестиУчетПоГТД, ЛОЖЬ) КАК ТребуетсяУказаниеНоменклатурыГТД,
	|	ВЫБОР
	|		КОГДА НЕ СправочникНоменклатураГТД.Ссылка ЕСТЬ NULL
	|				И (СправочникНоменклатураГТД.Владелец <> ТаблицаТовары.Номенклатура
	|					ИЛИ СправочникНоменклатураГТД.КодУКТВЭД <> ТаблицаТовары.КодУКТВЭД
	|					ИЛИ СправочникНоменклатураГТД.НомерГТД <> &НомерГТД
	|						И &НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НекорректнаяНоменклатураГТД
	|ПОМЕСТИТЬ ТоварыДляОбработки
	|ИЗ
	|	Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураГТД КАК СправочникНоменклатураГТД
	|		ПО ТаблицаТовары.НомерГТД = СправочникНоменклатураГТД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаможеннаяДекларацияИмпортТовары.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ИспользованнаяНоменклатураГТД
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(СправочникНоменклатураГТД.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)) КАК НоменклатураГТД,
	|	ВЫБОР
	|		КОГДА ИспользованнаяНоменклатураГТД.НомерГТД ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПриоритетПодбора,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КодУКТВЭД КАК КодУКТВЭД
	|ПОМЕСТИТЬ ТоварыДляЗаполнения
	|ИЗ
	|	ТоварыДляОбработки КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураГТД КАК СправочникНоменклатураГТД
	|			ЛЕВОЕ СОЕДИНЕНИЕ ИспользованнаяНоменклатураГТД КАК ИспользованнаяНоменклатураГТД
	|			ПО СправочникНоменклатураГТД.Ссылка = ИспользованнаяНоменклатураГТД.НомерГТД
	|		ПО Товары.Номенклатура = СправочникНоменклатураГТД.Владелец
	|			И Товары.КодУКТВЭД = СправочникНоменклатураГТД.КодУКТВЭД
	|			И (&НомерГТД = СправочникНоменклатураГТД.НомерГТД)
	|ГДЕ
	|	Товары.ТребуетсяУказаниеНоменклатурыГТД
	|	И (Товары.ПустаяНоменклатураГТД
	|			ИЛИ Товары.НекорректнаяНоменклатураГТД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДляЗаполнения.НомерСтроки КАК НомерСтроки,
	|	ТоварыДляЗаполнения.НоменклатураГТД КАК НоменклатураГТД,
	|	ТоварыДляЗаполнения.ПриоритетПодбора КАК ПриоритетПодбора
	|ИЗ
	|	ТоварыДляЗаполнения КАК ТоварыДляЗаполнения
	|ГДЕ
	|	ТоварыДляЗаполнения.НоменклатураГТД <> ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ПриоритетПодбора УБЫВ
	|ИТОГИ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ                        
	|	ТоварыДляЗаполнения.Номенклатура КАК Номенклатура,
	|	ТоварыДляЗаполнения.КодУКТВЭД КАК КодУКТВЭД
	|ИЗ
	|	ТоварыДляЗаполнения КАК ТоварыДляЗаполнения
	|ГДЕ
	|	ТоварыДляЗаполнения.НоменклатураГТД = ЗНАЧЕНИЕ(Справочник.НоменклатураГТД.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ТоварыДляОбработки КАК Товары
	|ГДЕ
	|	Товары.НекорректнаяНоменклатураГТД
	|	И НЕ Товары.ТребуетсяУказаниеНоменклатурыГТД";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Объект.Товары.Выгрузить(, "НомерСтроки, Номенклатура, КодУКТВЭД, НомерГТД"));
	Запрос.УстановитьПараметр("НомерГТД", Объект.НомерГТД);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПоследнийЗапрос = РезультатЗапроса.ВГраница();
	ТоварыДляЗаполнения = РезультатЗапроса[ПоследнийЗапрос - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТоварыДляСоздания = РезультатЗапроса[ПоследнийЗапрос - 1].Выбрать();
	ТоварыДляОчистки = РезультатЗапроса[ПоследнийЗапрос].Выбрать();
	
	Пока ТоварыДляЗаполнения.Следующий() Цикл
		
		Выборка = ТоварыДляЗаполнения.Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.Товары[Выборка.НомерСтроки - 1].НомерГТД = Выборка.НоменклатураГТД;
		КонецЕсли;
		
	КонецЦикла;
	
	КодЯзыка = МультиязычностьУкр.КодЯзыкаИнформационнойБазы();
	Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Элемент создан автоматически при проведении документа ""%1""';uk='Елемент створений автоматично при проведенні документа ""%1""'"), 
		?(Объект.ЭтоНовый(),  МультиязычностьУкр.ПолучитьЛокализованныйСинонимОбъекта(Объект, КодЯзыка), МультиязычностьУкр.ПолучитьЛокализованноеПредставление(Объект, КодЯзыка)));
	СтруктураПоиска = Новый Структура("НомерГТД, Номенклатура, КодУКТВЭД", Справочники.НоменклатураГТД.ПустаяСсылка(),,);		
	
	Пока ТоварыДляСоздания.Следующий() Цикл
		
		НоменклатураГТДОбъект = Справочники.НоменклатураГТД.СоздатьЭлемент();
		НоменклатураГТДОбъект.Владелец = ТоварыДляСоздания.Номенклатура;
		НоменклатураГТДОбъект.КодУКТВЭД = ТоварыДляСоздания.КодУКТВЭД;
		НоменклатураГТДОбъект.НомерГТД = Объект.НомерГТД;
		НоменклатураГТДОбъект.Комментарий = Комментарий;
		
		Попытка
			НоменклатураГТДОбъект.Записать();
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Ошибка при автоматическом создании кодов для НН: %1';uk='Помилка при автоматичному створенні кодів для ПН: %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТоварыДляСоздания);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.НомерГТД = НоменклатураГТДОбъект.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
	Пока ТоварыДляОчистки.Следующий() Цикл
		
		Объект.Товары[ТоварыДляОчистки.НомерСтроки - 1].НомерГТД = Справочники.НоменклатураГТД.ПустаяСсылка();
		
	КонецЦикла;

КонецПроцедуры

#Область Проведение



#КонецОбласти

#КонецОбласти

//-- Локализация
